[
  {
    "slug": "the-death-of-www.md",
    "title": "The Death of WWW",
    "date": "2013-08-30T00:00:00.000Z",
    "excerpt": "The ‘WWW’ subdomain is deprecated. There. I said it.",
    "words": 648
  },
  {
    "slug": "nineteen-eighty-four.md",
    "title": "Nineteen Eighty-four",
    "date": "2013-10-09T00:00:00.000Z",
    "excerpt": "‘Reality control,’ they called it—in Newspeak, ‘doublethink.’",
    "words": 1279
  },
  {
    "slug": "made-with-love-in-india.md",
    "title": "Made with ♥ in India",
    "date": "2013-10-13T00:00:00.000Z",
    "excerpt": "We’re a group of products and organizations which were proudly created in India.",
    "words": 284
  },
  {
    "slug": "internet-org.md",
    "title": "Internet.org Redesign",
    "date": "2013-10-27T00:00:00.000Z",
    "excerpt": "I recently participated in an event where I was required to redesign Internet. org’s homepage and logo. The content had to remain the same, but the design was to be completely new. The website was required to be responsive, and good in code-quality and aesthetics, without the use of any external code. The logo was marked for creativity and execution. Here’s what I co-designed with Akshat Srivastava in five hours. And why.",
    "words": 930
  },
  {
    "slug": "design.md",
    "title": "Design",
    "date": "2013-12-16T00:00:00.000Z",
    "words": 409
  },
  {
    "slug": "fleksy-keyboard.md",
    "title": "Fleksy Keyboard Review",
    "date": "2014-02-07T00:00:00.000Z",
    "excerpt": "_Disclaimer: I wrote this article for the Fleksy Blog and they provided me with the premium version of the app, which, for the record, is worth the $3. 99.",
    "words": 763
  },
  {
    "slug": "classrebels.md",
    "title": "The ClassRebels Dream",
    "date": "2014-05-10T00:00:00.000Z",
    "excerpt": "> “A substandard education will always result in a substandard nation. ” — Aubrey",
    "words": 380
  },
  {
    "slug": "surface-pro-3.md",
    "title": "Surface Pro 3",
    "date": "2014-05-22T00:00:00.000Z",
    "excerpt": "There were only two companies in this world that I truly adored for their great products—Apple and Google. I was also always a fan of the innovations at Microsoft, but they never really rocked my world. Until now.",
    "words": 625
  },
  {
    "slug": "on-operating-systems.md",
    "title": "A Designer on Operating Systems",
    "date": "2014-10-21T00:00:00.000Z",
    "excerpt": "A Silicon Valley startup was founded in 2003 with an aim to develop an advanced operating system for digital cameras. Considering that the camera market wasn’t large-enough, they started work on a mobile OS, and were acquired by Google two years later. Currently, they have over a billion active monthly users, which has doubled from 538 million in mid-2013.",
    "words": 1646
  },
  {
    "slug": "apple-remote.md",
    "title": "The Apple Remote",
    "date": "2015-03-15T00:00:00.000Z",
    "excerpt": "I had my hands-on a magnificent device this week — a remote. But this isn’t just any remote, it’s one of the most beautiful devices I’ve ever held in my hand. It’s the Apple Remote.",
    "words": 723
  },
  {
    "slug": "one-space-after-a-period.md",
    "title": "One Space After a Period",
    "date": "2015-03-23T00:00:00.000Z",
    "excerpt": "Early typewriters used monospaced fonts, meaning that the spaces between letters were always the same length, and so, typists started using two spaces to slightly widen the space between sentences. Now that the fonts on your computer are are proportionally spaced, this practice is outdated; it creates unnecessary inconvenience for the writer.",
    "words": 296
  },
  {
    "slug": "naming-brands.md",
    "title": "How to Name Brands",
    "date": "2015-06-26T00:00:00.000Z",
    "excerpt": "Pinkberry, a popular frozen yogurt chain, has spurred countless imitators with “berry”-studded names, so when a yogurt chain approached Alexandra Watkins, the chief innovation officer of Eat My Words, a San Francisco-based company that names brands, she wanted to help them find a really distinctive name.",
    "words": 618
  },
  {
    "slug": "too-simple-design.md",
    "title": "Can Design Be Too Simple?",
    "date": "2015-06-26T00:00:00.000Z",
    "excerpt": "John McWade asks a very interesting question in his article How simple is too simple? He",
    "words": 623
  },
  {
    "slug": "gaana-identity.md",
    "title": "The Problem with Gaana.com’s Identity",
    "date": "2015-08-30T00:00:00.000Z",
    "excerpt": "What is probably India’s most-used music streaming service, Gaana (“song” in Hindi), launched a new advertising campaign this month. It was very well executed with a great music video, beautiful typography and useful app demos at the end. Campaigns like these add to the brand value of a company — people see themselves dancing to songs on Gaana. But what’s missing here? What is the first thing users see when they download the app?",
    "words": 788
  },
  {
    "slug": "saga-music.md",
    "title": "Introducing Saga Music",
    "date": "2016-01-13T00:00:00.000Z",
    "excerpt": "Music has always been an integral part of our lives. Ever since people started using the internet, they’ve been downloading music and movies. The process became relatively simple with the introduction of Napster in 1999, which led to the development of many such tools. I remember growing up with Limewire and Bearshare. After the discontinuation of these services in after ten long years, downloading music became really complicated again.",
    "words": 215
  },
  {
    "slug": "30-billion-opportunity.md",
    "title": "The Missed $30 Billion Opportunity",
    "date": "2016-02-25T00:00:00.000Z",
    "excerpt": "When I posted [Study, but with a Difference](https://medium. com/@anandchowdhary/study-but-with-a-difference-89e0cb23ba85) two years back, my friends and I had an incredible idea that was going to change the way students think of education in India. We wanted to create a platform where students and teachers can find each other. We soon moved to a platform where students can access good-quality study material for free.",
    "words": 472
  },
  {
    "slug": "machine-learning-in-6-lines.md",
    "title": "Machine Learning in 6 Lines",
    "date": "2016-09-09T00:00:00.000Z",
    "excerpt": "At Oswald Foundation, we’re currently building a user interface for the blind, a smartphone UI that works entirely on vibrational and speech feedback. While reengineering the Phone app, the app you use to make calls, we decided to incorporate some machine learning.",
    "words": 469
  },
  {
    "slug": "md5.md",
    "title": "The Defence for MD5",
    "date": "2017-02-26T00:00:00.000Z",
    "excerpt": "A few days ago, I tried to reset my password on PR. com, the press releases website. I entered my email, and they sent me the username and password in plain text. That's right, in plain text.",
    "words": 455
  },
  {
    "slug": "college.md",
    "title": "Life Update: College",
    "date": "2017-03-01T00:00:00.000Z",
    "excerpt": "Just a little bit of background about my college \"situation\". How I went from design school in India to back to New Delhi to the University of Twente in the Netherlands. I wrote this post in March 2017 and updated it in December 2017.",
    "words": 456
  },
  {
    "slug": "zomato.md",
    "title": "Zomato for Android Redesign",
    "date": "2017-04-11T00:00:00.000Z",
    "excerpt": "I took fifteen minutes to make some strategic design changes to Zomato's Android app. I wrote extensively about the iconography, typography, and role of actions in the app’s user experience. I wrote this article originally in March 2016 for the Zomato Android team and publicly published it on Medium in April 2017 since Zomato decided to implement most of my design changes.",
    "words": 69
  },
  {
    "slug": "utwente-peoplepages.md",
    "title": "UTwente PeoplePages Contact Book",
    "date": "2017-08-12T00:00:00.000Z",
    "excerpt": "As a future creative technology student at the University of Twente, I wanted to get in touch with a particular professor. Their website, [PeoplePages](https://people. utwente. nl/), uses a RESTful API for AJAX requests to search for university staff, so I decided to add everyone to my contacts using API scraping to save time in the future.",
    "words": 704
  },
  {
    "slug": "state-of-the-podcasts-2018.md",
    "title": "State of the Podcasts 2018",
    "date": "2018-05-28T00:00:00.000Z",
    "excerpt": "I started _really_ consuming audio content in the form of podcasts and audiobooks about two years ago, and I'm very often asked what podcasts I listen to. This is the first list in a series of reviews about my daily drivers of content, services, and products.",
    "words": 895
  },
  {
    "slug": "new-agastya.md",
    "title": "Introducing the new Agastya",
    "date": "2018-06-09T00:00:00.000Z",
    "excerpt": "Since we launched Agastya in late 2016, we’ve come a long way. Today, we’re announcing the biggest update to our end-to-end web accessibility platform. This update is currently available only to our Pro 1M customers, and will be available to everyone this summer.",
    "words": 560
  },
  {
    "slug": "agastya-screen-reader.md",
    "title": "Introducing Universal Screen Reader on Agastya",
    "date": "2018-07-15T00:00:00.000Z",
    "excerpt": "Read aloud was one of Agastya’s signature features when it first launched, and our beta partners like [Nayee Disha](http://www. nayeedisha. in/about) — a collaboration between the UNDP and large corporates to skill and employ women in rural India — extensively made use of it. It was the easiest way to have a blind- and illiterate-friendly mode which automatically reads aloud the content of a webpage.",
    "words": 504
  },
  {
    "slug": "state-of-the-dock-2018.md",
    "title": "State of the Dock 2018",
    "date": "2018-07-28T00:00:00.000Z",
    "excerpt": "Two months after writing [State of the Podcasts](/blog/state-of-the/podcasts/2018/), where I talked about my go-to podcasts in 2018, this post is about the apps that find their home on my laptop's dock. These apps are those I use most often and make me much more productive.",
    "words": 784
  },
  {
    "slug": "google-docs-github.md",
    "title": "Google Docs + GitHub",
    "date": "2019-03-11T17:44:38.000Z",
    "excerpt": "When I first started using Google Docs, my favorite feature was \"smart\" autosaving. \"Smart\" because it's not just an interval, but also based on content changes. Today, almost all popular web-based text editors have both autosaving (WordPress, Medium, etc. ) and rich text formatting (think \\[f]CKEditor and TinyMCE a decade ago).",
    "words": 153
  },
  {
    "slug": "twitter-subaccounts.md",
    "title": "Twitter Subaccounts",
    "date": "2019-03-12T18:02:42.000Z",
    "excerpt": "I think Twitter should have a concept of sub-accounts. It's not smart to create a Twitter account for every small project, but it's often a necessity for support or a social media presence. In my case, I have a [Twitter account](https://twitter. com/AnandChowdhary), and so does [Oswald Labs](https://twitter. com/OswaldLabs) (which makes complete sense since it's a company and I'm just a small part of it).",
    "words": 281
  },
  {
    "slug": "package-managers.md",
    "title": "Package Manager Standardization",
    "date": "2019-03-15T18:54:59.000Z",
    "excerpt": "Matt Turnbull has a great article titled [Why Are You Still Using Yarn in 2018? ](https://iamturns. com/yarn-vs-npm-2018/) which makes the argument that newer versions of NPM are just as fast as Yarn and switching to NPM might actually have some benefits (I'm still a Yarn user).",
    "words": 239
  },
  {
    "slug": "quarter-of-open-source.md",
    "title": "Quarter of Open Source",
    "date": "2019-04-04T10:01:23.000Z",
    "excerpt": "The first quarter of 2019 was very interesting for me. It was the first time I did a lot of open-source work as a way to scratch my own itch. Every time I thought I needed a specific tool which I couldn't find, I built and open-sourced it.",
    "words": 1229
  },
  {
    "slug": "agastya-4-augmentally.md",
    "title": "Introducing Agastya 4 + Augmenta11y",
    "date": "2019-05-06T00:00:00.000Z",
    "excerpt": "11 months ago, [we launched Agastya 3](https://blog. oswald. foundation/introducing-the-new-agastya-privacy-first-and-universal-9a67ef66cb19), with the promise of a privacy-first accessibility widget. Today, we bring the next major version of Agastya with a focus on user customization, along with an entirely new app. Like the last update, Agastya 4 is currently available to our Pro 1M customers, and will be available to everyone this summer.",
    "words": 1063
  },
  {
    "slug": "state-of-the-podcasts-2019.md",
    "title": "State of the Podcasts 2019",
    "date": "2019-06-12T00:00:00.000Z",
    "excerpt": "This is the second year of my annual State of the Podcasts list, where I highlight my daily drivers of audio content. This time last year, I published [State of the Podcasts 2018](/blog/state-of-the/podcasts/2018/), and not too much has changed. Let's see what has.",
    "words": 700
  },
  {
    "slug": "google-play-badges.md",
    "title": "New Google Play Badges",
    "date": "2019-08-31T12:05:38.000Z",
    "excerpt": "When you're advertising your smartphone app, perhaps the first thing you show off are platform badges. They're the easiest and most familiar way to tell users where they can find your app. All major platforms, Apple's App Store, Google Play, and Microsoft Store have official badges which are somewhat consistent with each other.",
    "words": 226
  },
  {
    "slug": "introducing-uppload-v2.md",
    "title": "Introducing Uppload v2",
    "date": "2020-01-03T00:00:00.000Z",
    "excerpt": "In April 2018, I made the first commit to Uppload ([56bd930](https://github. com/elninotech/uppload/commit/56bd9307a020c692ed1383f0f4731690c00d90c9)) and pitched it as an idea to Michael, the founder of El Niño, to fund the development of an open-source JavaScript file uploader, something that the web desperately needed. Later that summer, we launched Uppload and started using it in our projects.",
    "words": 90
  },
  {
    "slug": "microsoft-open-source.md",
    "title": "Microsoft is the most important company in the open-source ecosystem",
    "date": "2020-06-28T08:17:00.000Z",
    "excerpt": "This was a sidenote for another note I've been thinking about, but I think it deserves its own post. Today (mid 2020), Microsoft is the world's most important, influential, and exciting company in the open-source ecosystem.",
    "words": 257
  },
  {
    "slug": "automated-journalism-authorship.md",
    "title": "Who is the author of an AI-generated news article?",
    "date": "2020-06-28T10:18:00.000Z",
    "excerpt": "If you read major American newspapers such as Forbes or the Los Angeles Times, chances are you've already read a story entirely written by an AI-powered software system. This process is known as automated journalism, and highlights an important question about authorship: _Who is the author of an article written by a virtual agent? _. A 2005 study found that research participants attribute story credit to the programmers who developed the AI or the news organization publishing the story.",
    "words": 393
  },
  {
    "slug": "yc-batch-size.md",
    "title": "1,000 companies per batch? OMG Y Combinator",
    "date": "2021-12-12T18:04:50.000Z",
    "excerpt": "This is a response to [1,000 companies per Y Combinator batch? RIP Y Combinator](https://techcrunch. com/2021/12/10/y-combinator/) by Haje Jan Kamps, published on TechCrunch on December 10, 2021.",
    "words": 961
  },
  {
    "slug": "year-of-teamwork.md",
    "title": "2022 will be the Year of Teamwork",
    "date": "2021-12-29T19:04:50.000Z",
    "excerpt": "I turn 24 today and I wanted to take this opportunity to reflect on my themes from the past two years, and plan my theme for 2022.",
    "words": 1159
  }
]
